In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv('athlete_events.csv', sep=',', index_col=None, engine='python')
df1.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [6]:
df2 = df1.dropna(subset=['Age','Height','Weight'])

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 206165 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      206165 non-null  int64
 1   Name    206165 non-null  object
 2   Sex     206165 non-null  object
 3   Age     206165 non-null  float64
 4   Height  206165 non-null  float64
 5   Weight  206165 non-null  float64
 6   Team    206165 non-null  object
 7   NOC     206165 non-null  object
 8   Games   206165 non-null  object
 9   Year    206165 non-null  int64
 10  Season  206165 non-null  object
 11  City    206165 non-null  object
 12  Sport   206165 non-null  object
 13  Event   206165 non-null  object
 14  Medal   30181 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 25.2+ MB

In [4]:
obj_df = df1.select_dtypes(include=['object']).copy()
obj_df.head()

,Name,Sex,Team,NOC,Games,Season,City,Sport,Event,Medal
0,A Dijiang,M,China,CHN,1992 Summer,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,A Lamusi,M,China,CHN,2012 Summer,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,Gunnar Nielsen Aaby,M,Denmark,DEN,1920 Summer,Summer,Antwerpen,Football,Football Men's Football,NaN
3,Edgar Lindenau Aabye,M,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,Christine Jacoba Aaftink,F,Netherlands,NED,1988 Winter,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [8]:
obj_df=obj_df.drop(columns=['Name', 'NOC'])
obj_df.head()

,Sex,Team,Games,Season,City,Sport,Event,Medal
0,M,China,1992 Summer,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,M,China,2012 Summer,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,M,Denmark,1920 Summer,Summer,Antwerpen,Football,Football Men's Football,NaN
3,M,Denmark/Sweden,1900 Summer,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,F,Netherlands,1988 Winter,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [11]:
# One trick you can use in pandas is to convert a column to a category, 
# then use those category values for your label encoding:
# Then you can assign the encoded variable to a new column using the cat.codes accessor:
obj_df1=obj_df

In [12]:
obj_df1["Team"] = obj_df1["Team"].astype('category')

obj_df1["Team_nume"] = obj_df1["Team"].cat.codes
obj_df1.head()

,Sex,Team,Games,Season,City,Sport,Event,Medal,Team_nume
0,M,China,1992 Summer,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,198
1,M,China,2012 Summer,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,198
2,M,Denmark,1920 Summer,Summer,Antwerpen,Football,Football Men's Football,NaN,273
3,M,Denmark/Sweden,1900 Summer,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,278
4,F,Netherlands,1988 Winter,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,704